In [8]:
import pandas as pd
import numpy as np

In [23]:
###
# Duplicados
###

datos = {
    'Nombres':   ['Paula', 'Susana', 'Paula', 'Oscar', 'Karen'],
    'Sexo':      ['F', 'F', 'F', 'M', 'F'],
    'Est_Civil': ['Soltera', 'Soltera', 'Casada', 'Divorciado', 'Viuda'],
    'Edad':      [22, 22, 22, 23, 19]
}
df_datos = pd.DataFrame(datos)
df_datos

  Nombres Sexo   Est_Civil  Edad
0   Paula    F     Soltera    22
1  Susana    F     Soltera    22
2   Paula    F      Casada    22
3   Oscar    M  Divorciado    23
4   Karen    F       Viuda    19

In [10]:
df_datos.duplicated()

0    False
1     True
2     True
3    False
4    False
dtype: bool

In [11]:
# Conteo
print(df_datos.duplicated().sum())

2

In [12]:
# En columnas
df_datos.duplicated(subset='Edad')
df_datos.duplicated(subset=['Sexo','Edad'])

0    False
1     True
2     True
3    False
4    False
dtype: bool

In [ ]:
###
# Eliminación
###

# Todos los campos son iguales
df_datos.drop_duplicates()      # Por defecto elimina el último o últimos
df_datos.drop_duplicates(keep='last')   # Mantiene el último de los duplicados

  Nombres Sexo   Est_Civil  Edad
2   Paula    F     Soltera    22
3   Oscar    M  Divorciado    23
4   Karen    F       Viuda    19

In [ ]:
# Eliminación por columna
df_datos.drop_duplicates(['Est_Civil'])

  Nombres Sexo   Est_Civil  Edad
0   Paula    F     Soltera    22
2   Paula    F      Casada    22
3   Oscar    M  Divorciado    23
4   Karen    F       Viuda    19

In [24]:
# Eliminación por columnas
df_datos.drop_duplicates(['Sexo', 'Edad'], keep='last')

  Nombres Sexo   Est_Civil  Edad
2   Paula    F      Casada    22
3   Oscar    M  Divorciado    23
4   Karen    F       Viuda    19